---
kind: method
id: M:Autodesk.Revit.DB.RoutingConditions.Clear
source: html/f62c1a88-b134-4eff-cb32-e1f1726f8d0f.htm
---
# Autodesk.Revit.DB.RoutingConditions.Clear Method

Clear all existing conditions

## Syntax (C#)
```csharp
public void Clear()
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.